{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a1280b35",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define Neo4j connections\n",
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "host = 'bolt://3.83.239.168:7687'\n",
    "user = 'neo4j'\n",
    "password = 'swim-ram-percents'\n",
    "driver = GraphDatabase.driver(host,auth=(user, password))\n",
    "\n",
    "def run_query(query, params={}):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        return pd.DataFrame([r.values() for r in result], columns=result.keys())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "81cad3ea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "CREATE CONSTRAINT n10s_unique_uri IF NOT EXISTS ON (r:Resource)\n",
    "ASSERT r.uri IS UNIQUE\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6523f9ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>param</th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>handleVocabUris</td>\n",
       "      <td>MAP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>handleMultival</td>\n",
       "      <td>OVERWRITE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>handleRDFTypes</td>\n",
       "      <td>LABELS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>keepLangTag</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>keepCustomDataTypes</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>applyNeo4jNaming</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>baseSchemaNamespace</td>\n",
       "      <td>neo4j://graph.schema#</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>baseSchemaPrefix</td>\n",
       "      <td>n4sch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>classLabel</td>\n",
       "      <td>Class</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>subClassOfRel</td>\n",
       "      <td>SCO</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>dataTypePropertyLabel</td>\n",
       "      <td>Property</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>objectPropertyLabel</td>\n",
       "      <td>Relationship</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>subPropertyOfRel</td>\n",
       "      <td>SPO</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>domainRel</td>\n",
       "      <td>DOMAIN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>rangeRel</td>\n",
       "      <td>RANGE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    param                  value\n",
       "0         handleVocabUris                    MAP\n",
       "1          handleMultival              OVERWRITE\n",
       "2          handleRDFTypes                 LABELS\n",
       "3             keepLangTag                  False\n",
       "4     keepCustomDataTypes                  False\n",
       "5        applyNeo4jNaming                   True\n",
       "6     baseSchemaNamespace  neo4j://graph.schema#\n",
       "7        baseSchemaPrefix                  n4sch\n",
       "8              classLabel                  Class\n",
       "9           subClassOfRel                    SCO\n",
       "10  dataTypePropertyLabel               Property\n",
       "11    objectPropertyLabel           Relationship\n",
       "12       subPropertyOfRel                    SPO\n",
       "13              domainRel                 DOMAIN\n",
       "14               rangeRel                  RANGE"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "CALL n10s.graphconfig.init({\n",
    "  handleVocabUris: 'MAP',\n",
    "  applyNeo4jNaming: true\n",
    "})\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "881392a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from requests.structures import CaseInsensitiveDict\n",
    "\n",
    "# Query to import RDF/XML data to Neo4j using Neosemantics\n",
    "import_rdf_query = \"\"\"\n",
    "UNWIND $data AS link\n",
    "CALL n10s.rdf.import.fetch(\n",
    "  link,\n",
    "  'RDF/XML'\n",
    ") YIELD triplesLoaded\n",
    "RETURN sum(triplesLoaded) AS totalTriplesLoaded\n",
    "\"\"\"\n",
    "\n",
    "def make_request(uri):\n",
    "    # For some reason, the API only works when I pretend to be a browser\n",
    "    headers = CaseInsensitiveDict()\n",
    "    headers[\"user-agent\"] = \"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45 Safari/537.36\"\n",
    "    return requests.get(uri, headers=headers)\n",
    "    \n",
    "def ukgazzette_to_neo4j(pages=1, categorycode=\"\", noticetype=\"\"):\n",
    "    for page in range(1, pages + 1):\n",
    "        baseUrl = f\"https://www.thegazette.co.uk/all-notices/notice/data.json\"\n",
    "        ccode = \"categorycode=\" + categorycode + \"&\" if categorycode else \"\"\n",
    "        ntype = \"noticetype=\" + noticetype + \"&\" if noticetype else \"\"\n",
    "        parameters = f\"?{ccode}{ntype}results-page-size=100&sort-by=latest-date&results-page={page}\"\n",
    "        \n",
    "        try:\n",
    "            response = make_request(baseUrl + parameters)\n",
    "            responseJson = response.json()\n",
    "        except Exception as e:\n",
    "            print(response.text)\n",
    "            print(e)\n",
    "            break\n",
    "\n",
    "        # Define RDF/XML URL links\n",
    "        data = []\n",
    "        for notice in responseJson['entry']:\n",
    "            id = notice['id'].split('/')[-1]\n",
    "            rdf_uri = f\"https://www.thegazette.co.uk/notice/{id}/data.rdf?view=linked-data\"\n",
    "            data.append(rdf_uri)\n",
    "\n",
    "        # Import RDF into Neo4j with Neosemantics\n",
    "        query_response = run_query(import_rdf_query, {'data': data})\n",
    "        print(query_response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "4bae416b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   totalTriplesLoaded\n",
      "0                3519\n",
      "   totalTriplesLoaded\n",
      "0                4918\n",
      "   totalTriplesLoaded\n",
      "0                4953\n",
      "   totalTriplesLoaded\n",
      "0                5008\n",
      "   totalTriplesLoaded\n",
      "0                5110\n",
      "   totalTriplesLoaded\n",
      "0                4997\n",
      "   totalTriplesLoaded\n",
      "0                4899\n",
      "   totalTriplesLoaded\n",
      "0                4932\n",
      "   totalTriplesLoaded\n",
      "0                4928\n",
      "   totalTriplesLoaded\n",
      "0                4875\n"
     ]
    }
   ],
   "source": [
    "# Import last 1000 state notices\n",
    "ukgazzette_to_neo4j(10, \"11\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "73c24c18",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>award</th>\n",
       "      <th>relatedDate</th>\n",
       "      <th>person</th>\n",
       "      <th>jobTitle</th>\n",
       "      <th>organization</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B.E.M.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Darren Peter CLARK</td>\n",
       "      <td>First Secretary, Operational Delivery Manager</td>\n",
       "      <td>British Embassy Yangon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B.E.M.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Brian WARING</td>\n",
       "      <td>Desk Officer</td>\n",
       "      <td>Foreign, Commonwealth and Development Office</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B.E.M.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Bryn Owen WILLIAMS</td>\n",
       "      <td>Desk Officer</td>\n",
       "      <td>Foreign, Commonwealth and Development Office</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B.E.M.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Natalie Claire COLEMAN</td>\n",
       "      <td>Director</td>\n",
       "      <td>National Gallery of the Cayman Islands</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B.E.M.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Patricia Susan OWENS</td>\n",
       "      <td>Corporate Services Manager</td>\n",
       "      <td>Miami Consulate General</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    award relatedDate                  person  \\\n",
       "0  B.E.M.  2021-12-31      Darren Peter CLARK   \n",
       "1  B.E.M.  2021-12-31            Brian WARING   \n",
       "2  B.E.M.  2021-12-31      Bryn Owen WILLIAMS   \n",
       "3  B.E.M.  2021-12-31  Natalie Claire COLEMAN   \n",
       "4  B.E.M.  2021-12-31    Patricia Susan OWENS   \n",
       "\n",
       "                                        jobTitle  \\\n",
       "0  First Secretary, Operational Delivery Manager   \n",
       "1                                   Desk Officer   \n",
       "2                                   Desk Officer   \n",
       "3                                       Director   \n",
       "4                     Corporate Services Manager   \n",
       "\n",
       "                                   organization  \n",
       "0                        British Embassy Yangon  \n",
       "1  Foreign, Commonwealth and Development Office  \n",
       "2  Foreign, Commonwealth and Development Office  \n",
       "3        National Gallery of the Cayman Islands  \n",
       "4                       Miami Consulate General  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Who has received any awards\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (award)<-[:ISAWARDED]-(t:AwardandHonourThing)-[:HASAWARDEE]->(person)-[:HASEMPLOYMENT]->(employment)-[:ISMEMBEROFORGANISATION]->(organization)\n",
    "RETURN award.label AS award,\n",
    "       t.relatedDate AS relatedDate,\n",
    "       person.name AS person,\n",
    "       employment.jobTitle AS jobTitle,\n",
    "       organization.name AS organization\n",
    "ORDER BY relatedDate DESC\n",
    "LIMIT 5\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "17d7f94b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>award</th>\n",
       "      <th>date</th>\n",
       "      <th>appointee</th>\n",
       "      <th>authority</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C.B.E.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Bernard John TAUPIN</td>\n",
       "      <td>Central Chancery of the Orders of Knighthood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C.B.E.</td>\n",
       "      <td>2021-12-31</td>\n",
       "      <td>Robert Adrian STRINGER</td>\n",
       "      <td>Central Chancery of the Orders of Knighthood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C.B.E.</td>\n",
       "      <td>2021-12-22</td>\n",
       "      <td>Dr. Kai Hung LEE</td>\n",
       "      <td>Central Chancery of the Orders of Knighthood</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    award        date               appointee  \\\n",
       "0  C.B.E.  2021-12-31     Bernard John TAUPIN   \n",
       "1  C.B.E.  2021-12-31  Robert Adrian STRINGER   \n",
       "2  C.B.E.  2021-12-22        Dr. Kai Hung LEE   \n",
       "\n",
       "                                      authority  \n",
       "0  Central Chancery of the Orders of Knighthood  \n",
       "1  Central Chancery of the Orders of Knighthood  \n",
       "2  Central Chancery of the Orders of Knighthood  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (n:CommanderOrderOfTheBritishEmpire)<-[:ISAPPOINTEDAS]-(notice)-[:HASAPPOINTEE]->(appointee),\n",
    "      (notice)-[:HASAUTHORITY]->(authority)\n",
    "RETURN n.label AS award,\n",
    "       notice.relatedDate AS date,\n",
    "       appointee.name AS appointee,\n",
    "       authority.label AS authority\n",
    "ORDER BY date DESC\n",
    "LIMIT 5\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8d4addad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>noticeID</th>\n",
       "      <th>noticeURI</th>\n",
       "      <th>date</th>\n",
       "      <th>provenance</th>\n",
       "      <th>relatedLegislations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3999024</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3999024</td>\n",
       "      <td>2022-02-21</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3999024...</td>\n",
       "      <td>[Universities of Oxford and Cambridge Act 1923]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3999023</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3999023</td>\n",
       "      <td>2022-02-21</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3999023...</td>\n",
       "      <td>[Universities of Oxford and Cambridge Act 1923]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3992302</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3992302</td>\n",
       "      <td>2022-02-14</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3992302...</td>\n",
       "      <td>[BURIAL ACT 1853]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3991643</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3991643</td>\n",
       "      <td>2022-02-14</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3991643...</td>\n",
       "      <td>[BURIAL ACT 1853]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  noticeID                                       noticeURI        date  \\\n",
       "0  3999024  https://www.thegazette.co.uk/id/notice/3999024  2022-02-21   \n",
       "1  3999023  https://www.thegazette.co.uk/id/notice/3999023  2022-02-21   \n",
       "2  3992302  https://www.thegazette.co.uk/id/notice/3992302  2022-02-14   \n",
       "3  3991643  https://www.thegazette.co.uk/id/notice/3991643  2022-02-14   \n",
       "\n",
       "                                          provenance  \\\n",
       "0  https://www.thegazette.co.uk/id/notice/3999024...   \n",
       "1  https://www.thegazette.co.uk/id/notice/3999023...   \n",
       "2  https://www.thegazette.co.uk/id/notice/3992302...   \n",
       "3  https://www.thegazette.co.uk/id/notice/3991643...   \n",
       "\n",
       "                               relatedLegislations  \n",
       "0  [Universities of Oxford and Cambridge Act 1923]  \n",
       "1  [Universities of Oxford and Cambridge Act 1923]  \n",
       "2                                [BURIAL ACT 1853]  \n",
       "3                                [BURIAL ACT 1853]  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (provenance)<-[:HAS_PROVENANCE]-(n:Notice)-[:ISABOUT]->(l:Legislation:NotifiableThing)-[:RELATEDLEGISLATION]->(related)\n",
    "RETURN n.hasNoticeID AS noticeID,\n",
    "       n.uri AS noticeURI,\n",
    "       l.relatedDate AS date,\n",
    "       provenance.uri AS provenance,\n",
    "       collect(related.label) AS relatedLegislations\n",
    "ORDER BY date DESC\n",
    "LIMIT 5\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "9aae952c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   totalTriplesLoaded\n",
      "0                3998\n",
      "   totalTriplesLoaded\n",
      "0                4030\n",
      "   totalTriplesLoaded\n",
      "0                3894\n",
      "   totalTriplesLoaded\n",
      "0                3644\n",
      "   totalTriplesLoaded\n",
      "0                3300\n",
      "   totalTriplesLoaded\n",
      "0                4050\n",
      "   totalTriplesLoaded\n",
      "0                3905\n",
      "   totalTriplesLoaded\n",
      "0                4029\n",
      "   totalTriplesLoaded\n",
      "0                4228\n",
      "   totalTriplesLoaded\n",
      "0                4144\n"
     ]
    }
   ],
   "source": [
    "# Redemption or purchase of own shares out of capital, Company director disqualification order, Dissolution of partnership\n",
    "ukgazzette_to_neo4j(10, \"26+27\", \"2602+2608+2702\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "ef715f90",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>noticeID</th>\n",
       "      <th>date</th>\n",
       "      <th>noticeURI</th>\n",
       "      <th>enablingLegislation</th>\n",
       "      <th>partnership</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4001999</td>\n",
       "      <td>2022-02-25</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/4001999...</td>\n",
       "      <td>LIMITED PARTNERSHIPS ACT 1907</td>\n",
       "      <td>PRAMERICA REAL ESTATE CAPITAL I (SCOTLAND) LIM...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3996994</td>\n",
       "      <td>2022-02-18</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3996994...</td>\n",
       "      <td>PARTNERSHIP ACT 1890</td>\n",
       "      <td>\\n          W H MAYES PARTNERSHIP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3998712</td>\n",
       "      <td>2022-02-16</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3998712...</td>\n",
       "      <td>LIMITED PARTNERSHIPS ACT 1907 &amp; PARTNERSHIP AC...</td>\n",
       "      <td>\\n          Edammer Limited Partnership</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3991200</td>\n",
       "      <td>2022-02-15</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3991200...</td>\n",
       "      <td>LIMITED PARTNERSHIPS ACT 1907</td>\n",
       "      <td>17 CAPITAL MEZZANINE CO-INVEST LP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3991197</td>\n",
       "      <td>2022-02-11</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3991197...</td>\n",
       "      <td>LIMITED PARTNERSHIPS ACT 1907</td>\n",
       "      <td>17CAPITAL (OLYMPUS) LP</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  noticeID        date                                          noticeURI  \\\n",
       "0  4001999  2022-02-25  https://www.thegazette.co.uk/id/notice/4001999...   \n",
       "1  3996994  2022-02-18  https://www.thegazette.co.uk/id/notice/3996994...   \n",
       "2  3998712  2022-02-16  https://www.thegazette.co.uk/id/notice/3998712...   \n",
       "3  3991200  2022-02-15  https://www.thegazette.co.uk/id/notice/3991200...   \n",
       "4  3991197  2022-02-11  https://www.thegazette.co.uk/id/notice/3991197...   \n",
       "\n",
       "                                 enablingLegislation  \\\n",
       "0                      LIMITED PARTNERSHIPS ACT 1907   \n",
       "1                               PARTNERSHIP ACT 1890   \n",
       "2  LIMITED PARTNERSHIPS ACT 1907 & PARTNERSHIP AC...   \n",
       "3                      LIMITED PARTNERSHIPS ACT 1907   \n",
       "4                      LIMITED PARTNERSHIPS ACT 1907   \n",
       "\n",
       "                                         partnership  \n",
       "0  PRAMERICA REAL ESTATE CAPITAL I (SCOTLAND) LIM...  \n",
       "1                  \\n          W H MAYES PARTNERSHIP  \n",
       "2           \\n          Edammer Limited Partnership   \n",
       "3                  17 CAPITAL MEZZANINE CO-INVEST LP  \n",
       "4                             17CAPITAL (OLYMPUS) LP  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (n:PartnershipDissolutionNotice)-[:ISABOUT]->(notifiableThing)-[:HASCOMPANY]->(partnership),\n",
    "      (notifiableThing)-[:ISENABLEDBYLEGISLATION]->(enabledby)\n",
    "RETURN n.hasNoticeID AS noticeID,\n",
    "       notifiableThing.relatedDate AS date,\n",
    "       notifiableThing.uri AS noticeURI,\n",
    "       enabledby.label AS enablingLegislation,\n",
    "       partnership.name AS partnership\n",
    "ORDER BY date DESC\n",
    "LIMIT 5\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "442ff7fc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>date</th>\n",
       "      <th>company</th>\n",
       "      <th>companyURI</th>\n",
       "      <th>relatedLegislations</th>\n",
       "      <th>noticeURI</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2022-02-15</td>\n",
       "      <td>G. &amp; B. (NORTH WEST) LIMITED</td>\n",
       "      <td>http://business.data.gov.uk/id/company/01797547</td>\n",
       "      <td>[Companies Act 2006, Companies Act 2006, s. 719]</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3997065...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2022-02-01</td>\n",
       "      <td>\\n          RAS CAPITAL NO 1 LIMITED</td>\n",
       "      <td>http://business.data.gov.uk/id/company/10153195</td>\n",
       "      <td>[Companies Act 2006, Companies Act 2006, s. 719]</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3981164...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2022-01-07</td>\n",
       "      <td>ROOSTEN LIMITED</td>\n",
       "      <td>http://business.data.gov.uk/id/company/08123072</td>\n",
       "      <td>[Companies Act 2006, Companies Act 2006, s. 719]</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3969127...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2022-01-07</td>\n",
       "      <td>WOODMAN MOTOR COMPANY LIMITED</td>\n",
       "      <td>http://business.data.gov.uk/id/company/06453796</td>\n",
       "      <td>[Companies Act 2006, s. 714, Companies Act 200...</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3965706...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2021-12-27</td>\n",
       "      <td>APPLABS TECHNOLOGIES (UK) PVT LIMITED</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3961668...</td>\n",
       "      <td>[Companies Act 2006, s. 721, Companies Act 200...</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3961668...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         date                                company  \\\n",
       "0  2022-02-15           G. & B. (NORTH WEST) LIMITED   \n",
       "1  2022-02-01   \\n          RAS CAPITAL NO 1 LIMITED   \n",
       "2  2022-01-07                        ROOSTEN LIMITED   \n",
       "3  2022-01-07          WOODMAN MOTOR COMPANY LIMITED   \n",
       "4  2021-12-27  APPLABS TECHNOLOGIES (UK) PVT LIMITED   \n",
       "\n",
       "                                          companyURI  \\\n",
       "0    http://business.data.gov.uk/id/company/01797547   \n",
       "1    http://business.data.gov.uk/id/company/10153195   \n",
       "2    http://business.data.gov.uk/id/company/08123072   \n",
       "3    http://business.data.gov.uk/id/company/06453796   \n",
       "4  https://www.thegazette.co.uk/id/notice/3961668...   \n",
       "\n",
       "                                 relatedLegislations  \\\n",
       "0   [Companies Act 2006, Companies Act 2006, s. 719]   \n",
       "1   [Companies Act 2006, Companies Act 2006, s. 719]   \n",
       "2   [Companies Act 2006, Companies Act 2006, s. 719]   \n",
       "3  [Companies Act 2006, s. 714, Companies Act 200...   \n",
       "4  [Companies Act 2006, s. 721, Companies Act 200...   \n",
       "\n",
       "                                           noticeURI  \n",
       "0  https://www.thegazette.co.uk/id/notice/3997065...  \n",
       "1  https://www.thegazette.co.uk/id/notice/3981164...  \n",
       "2  https://www.thegazette.co.uk/id/notice/3969127...  \n",
       "3  https://www.thegazette.co.uk/id/notice/3965706...  \n",
       "4  https://www.thegazette.co.uk/id/notice/3961668...  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (legislation)<-[:RELATEDLEGISLATION]-(n:RedemptionOrPurchase)-[:HASCOMPANY]->(company)\n",
    "RETURN n.relatedDate AS date,\n",
    "       company.name AS company,\n",
    "       company.uri AS companyURI,\n",
    "       collect(legislation.label) AS relatedLegislations,\n",
    "       n.uri AS noticeURI\n",
    "ORDER BY date DESC\n",
    "LIMIT 5\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4736255c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>noticeID</th>\n",
       "      <th>noticeURI</th>\n",
       "      <th>date</th>\n",
       "      <th>company</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3984531</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3984531</td>\n",
       "      <td>2022-02-03</td>\n",
       "      <td>WALES FAMILY PARTNERSHIP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3981940</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3981940</td>\n",
       "      <td>2022-02-01</td>\n",
       "      <td>INVERGORDON D SCOTTISH LIMITED PARTNERSHIP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3985272</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3985272</td>\n",
       "      <td>2022-01-31</td>\n",
       "      <td>Gilberts Chartered Accountants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3970041</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3970041</td>\n",
       "      <td>2022-01-14</td>\n",
       "      <td>\\n          KINGSWOOD SURGERY TUNBRIDGEWELLS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3964974</td>\n",
       "      <td>https://www.thegazette.co.uk/id/notice/3964974</td>\n",
       "      <td>2022-01-05</td>\n",
       "      <td>Thornton &amp; Wright Opticians</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  noticeID                                       noticeURI        date  \\\n",
       "0  3984531  https://www.thegazette.co.uk/id/notice/3984531  2022-02-03   \n",
       "1  3981940  https://www.thegazette.co.uk/id/notice/3981940  2022-02-01   \n",
       "2  3985272  https://www.thegazette.co.uk/id/notice/3985272  2022-01-31   \n",
       "3  3970041  https://www.thegazette.co.uk/id/notice/3970041  2022-01-14   \n",
       "4  3964974  https://www.thegazette.co.uk/id/notice/3964974  2022-01-05   \n",
       "\n",
       "                                        company  \n",
       "0                      WALES FAMILY PARTNERSHIP  \n",
       "1    INVERGORDON D SCOTTISH LIMITED PARTNERSHIP  \n",
       "2                Gilberts Chartered Accountants  \n",
       "3  \\n          KINGSWOOD SURGERY TUNBRIDGEWELLS  \n",
       "4                   Thornton & Wright Opticians  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (notice)-[:ISABOUT]->(n:PartnershipChangeInMembers)-[:HASCOMPANY]->(company)\n",
    "RETURN notice.hasNoticeID AS noticeID,\n",
    "       notice.uri AS noticeURI,\n",
    "       n.relatedDate AS date,\n",
    "       company.name AS company\n",
    "ORDER BY date DESC\n",
    "LIMIT 5\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "64405655",
   "metadata": {},
   "outputs": [],
   "source": [
    "from bs4 import BeautifulSoup as bs\n",
    "import spacy\n",
    "\n",
    "nlp = spacy.load(\"en_core_web_sm\")\n",
    "\n",
    "def extract_entities(noticeId):\n",
    "    print(f\"\\nExtracting entities for {noticeId}\")\n",
    "    uri = f\"https://www.thegazette.co.uk/notice/{noticeId}/data.xml?download=true\"\n",
    "    content = make_request(uri).content\n",
    "    bs_content = bs(content, \"lxml\")\n",
    "    text = \" \".join([el.text for el in bs_content.findAll(\"p\", {\"data-gazettes\":\"Text\"})])\n",
    "    print(text)\n",
    "    doc = nlp(text)\n",
    "    # Find named entities, phrases and concepts\n",
    "    print('Entities \\n --------------------')\n",
    "    for entity in doc.ents:\n",
    "        if not entity.label_ in ['PERSON', 'ORG']:\n",
    "            continue\n",
    "        print(entity.text, entity.label_)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "a9a89af5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Extracting entities for 3996989\n",
      "\n",
      "Pursuant to section 10 of the Limited Partnerships Act 1907, notice is hereby given in respect of IIF UK 1 LP, a limited partnership registered in England with registered number LP012764 (the “Partnership”), that:\n",
      "\n",
      " 1.\tFCA Pension Plan Trustee Limited as trustee of the FCA Pension Plan was admitted as a new limited partner of the Partnership.\n",
      "\n",
      "          \n",
      "Entities \n",
      " --------------------\n",
      "IIF UK 1 LP ORG\n",
      "LP012764 ORG\n",
      "the FCA Pension Plan ORG\n",
      "\n",
      "Extracting entities for 3989075\n",
      "\n",
      "Notice is hereby given that Dr Stephen Kirkham, Dr Brij Patel and Dr John Hampson ceased to be a partners at Tower Family Healthcare, 16 Market St, Tottington, Bury, BL8 4AD. Dr Stephen Kirkham with effect from the 31st December 2021, Dr Brij Patel with effect from the 17th December 2021 and Dr John Hampson with effect from the 30th June 2021 . The business will continue with the remaining partners\n",
      "\n",
      "Entities \n",
      " --------------------\n",
      "Stephen Kirkham PERSON\n",
      "Dr Brij Patel PERSON\n",
      "John Hampson PERSON\n",
      "Tower Family Healthcare ORG\n",
      "Stephen Kirkham PERSON\n",
      "Brij Patel PERSON\n",
      "John Hampson PERSON\n",
      "\n",
      "Extracting entities for 3984531\n",
      "Notice is hereby given that on 3 February 2022, William Anthony Wales retired from the partnership that existed between him and Victoria Wales, Joanna Sarah Fleming, and Toby James Fleming, and the trustees of the David Wales Will Trust, carrying on the business of farming in and around Marham Norfolk at Manor, Eastgate, and Ashwood Lodge Farms.  Ag NH110404\n",
      "Entities \n",
      " --------------------\n",
      "William Anthony Wales PERSON\n",
      "Victoria Wales PERSON\n",
      "Sarah Fleming PERSON\n",
      "Toby James Fleming PERSON\n",
      "Marham Norfolk PERSON\n",
      "\n",
      "Extracting entities for 3985272\n",
      "\n",
      "          Notice is hereby given that Andrew George Lovett will retire as Partner from the partnership of Gilberts Chartered Accountants having its place of business at Pendragon House, 65 London Road, St Albans, Hertfordshire AL1 1LJ (\"the Partnership\") with effect from and including 1 February 2022. \n",
      " The Partnership will from and including 1 February 2022 be conducted by the remaining Partners being Richard William Hattrell, Amanda Jane Ruggles and Luke Thomas Parker. \n",
      "Entities \n",
      " --------------------\n",
      "Notice ORG\n",
      "Andrew George Lovett PERSON\n",
      "Partner PERSON\n",
      "Gilberts Chartered Accountants ORG\n",
      "Pendragon House ORG\n",
      "St Albans PERSON\n",
      "Richard William Hattrell PERSON\n",
      "Amanda Jane Ruggles PERSON\n",
      "Luke Thomas Parker PERSON\n",
      "\n",
      "Extracting entities for 3981940\n",
      "Registered in Scotland, Registered Number SL020261 Notice is hereby given, pursuant to section 10 of the Limited Partnership Act 1907, that, with effect from 17 February 2021, Alistair Ray has transferred his entire interest in the Partnership to Jadin Limited. As a result of the transfer, Alistair Ray has ceased to be a limited partner of the Partnership.  \n",
      "\n",
      " \n",
      "\n",
      " \n",
      "\n",
      " \n",
      "Entities \n",
      " --------------------\n",
      "Alistair Ray PERSON\n",
      "Alistair Ray PERSON\n"
     ]
    }
   ],
   "source": [
    "partnership_changes = run_query(\"\"\"\n",
    "MATCH (notice)-[:ISABOUT]->(n:PartnershipChangeInMembers)\n",
    "RETURN notice.hasNoticeID AS noticeID\n",
    "LIMIT 5\n",
    "\"\"\")['noticeID'].to_list()\n",
    "\n",
    "for i in partnership_changes:\n",
    "    extract_entities(i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "47afd616",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5e47fbb7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a4fdc741",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b04780f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
